{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyP6B/KrGV6o2YRo1U4/OVdP"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"markdown","source":["# Задание 1\n","Дана переменная, в которой хранится словарь, содержащий гео-метки для каждого пользователя (пример структуры данных приведен ниже). Вам необходимо написать программу, которая выведет на экран множество уникальных гео-меток всех пользователей.\n","\n","Пример работы программы:\n","\n","\n","\n","```\n","ids = {'user1': [213, 213, 213, 15, 213],\n","       'user2': [54, 54, 119, 119, 119],\n","       'user3': [213, 98, 98, 35]}\n","```\n","\n","\n","\n","Результат:\n","`{98, 35, 15, 213, 54, 119}`"],"metadata":{"id":"AcNIqtKaUsvR"}},{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"0d3mGPIRUj0E","executionInfo":{"status":"ok","timestamp":1728504025487,"user_tz":-180,"elapsed":288,"user":{"displayName":"Григорий","userId":"15787102738944645865"}},"outputId":"afa0ed50-1dbe-4a15-de96-3dc39a5813b7"},"outputs":[{"output_type":"stream","name":"stdout","text":["Result: {98, 35, 15, 213, 54, 119}\n"]}],"source":["ids = {'user1': [213, 213, 213, 15, 213],\n","       'user2': [54, 54, 119, 119, 119],\n","       'user3': [213, 98, 98, 35]}\n","\n","geo = sum(ids.values(), [])\n","\n","print(f'Result: {set(geo)}')"]},{"cell_type":"markdown","source":["# Задание 2\n","Дана переменная, в которой хранится список поисковых запросов пользователя (пример структуры данных приведен ниже, но запросы потенциально могут быть любые). Вам необходимо написать программу, которая выведет на экран распределение количества слов в запросах в требуемом виде.\n","\n","Пример работы программы:\n","```\n","queries = [\n","    'смотреть сериалы онлайн',\n","    'новости спорта',\n","    'афиша кино',\n","    'курс доллара',\n","    'сериалы этим летом',\n","    'курс по питону',\n","    'сериалы про спорт',\n","]\n","```\n","Результат:\n","```\n","Поисковых запросов, содержащих 2 слов(а): 42.86%\n","Поисковых запросов, содержащих 3 слов(а): 57.14%\n","```\n","\n"],"metadata":{"id":"p22-ysjnW3WE"}},{"cell_type":"code","source":["from collections import Counter\n","\n","queries = [\n","    'разбор футбольного матча россия испания',\n","    'мультфильм приключения рика и морти',\n","    'смотреть сериалы онлайн',\n","    'новости спорта',\n","    'афиша кино',\n","    'курс доллара',\n","    'сериалы этим летом',\n","    'курс по питону',\n","    'сериалы про спорт',\n","]\n","\n","n = len(queries)\n","cnt_words = Counter([len(quer.split()) for quer in queries])\n","\n","for key,val in cnt_words.items():\n","  print(f'Поисковых запросов, содержащих {key} слов(а): {round(val/n*100, 2)}%')"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"8LEuXDULXNei","executionInfo":{"status":"ok","timestamp":1728336803564,"user_tz":-180,"elapsed":287,"user":{"displayName":"Григорий","userId":"15787102738944645865"}},"outputId":"5eaf3fb0-b1cb-4227-db64-8d9ca7dc968a"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Поисковых запросов, содержащих 5 слов(а): 22.22%\n","Поисковых запросов, содержащих 3 слов(а): 44.44%\n","Поисковых запросов, содержащих 2 слов(а): 33.33%\n"]}]},{"cell_type":"markdown","source":["# Задание 3\n","Дана переменная, в которой хранится информация о затратах и доходе рекламных кампаний по различным источникам. Необходимо дополнить исходную структуру показателем ROI, который рассчитаем по формуле: ((revenue / cost) - 1) * 100"],"metadata":{"id":"exEm_nAcwtdq"}},{"cell_type":"code","source":["results = {\n","    'vk': {'revenue': 103, 'cost': 98},\n","    'yandex': {'revenue': 179, 'cost': 153},\n","    'facebook': {'revenue': 103, 'cost': 110},\n","    'adwords': {'revenue': 35, 'cost': 34},\n","    'twitter': {'revenue': 11, 'cost': 24},\n","}\n","\n","for metrics in results.values():\n","  metrics['ROI'] = round(((metrics['revenue'] /  metrics['cost']) - 1) * 100, 2)\n","\n","results"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"1T8OgquFUsll","executionInfo":{"status":"ok","timestamp":1728334893554,"user_tz":-180,"elapsed":291,"user":{"displayName":"Григорий","userId":"15787102738944645865"}},"outputId":"df9c33dc-7b40-4b45-9757-9de401cae685"},"execution_count":null,"outputs":[{"output_type":"execute_result","data":{"text/plain":["{'vk': {'revenue': 103, 'cost': 98, 'ROI': 5.1},\n"," 'yandex': {'revenue': 179, 'cost': 153, 'ROI': 16.99},\n"," 'facebook': {'revenue': 103, 'cost': 110, 'ROI': -6.36},\n"," 'adwords': {'revenue': 35, 'cost': 34, 'ROI': 2.94},\n"," 'twitter': {'revenue': 11, 'cost': 24, 'ROI': -54.17}}"]},"metadata":{},"execution_count":6}]},{"cell_type":"markdown","source":["# Задание 4\n","Дана переменная, в которой хранится статистика рекламных каналов по объемам продаж (пример структуры данных приведен ниже). Напишите программу, которая возвращает название канала с максимальным объемом продаж."],"metadata":{"id":"nOzN9hGSygrE"}},{"cell_type":"code","source":["stats = {'facebook': 55, 'yandex': 115, 'vk': 120, 'google': 99, 'email': 42, 'ok': 98}\n","print('Максимальный объем продаж на рекламном канале:', max(stats, key=stats.get))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"eufYuJwkyoGn","executionInfo":{"status":"ok","timestamp":1728335436652,"user_tz":-180,"elapsed":319,"user":{"displayName":"Григорий","userId":"15787102738944645865"}},"outputId":"9c6656bc-f94a-4c5c-b4dd-18accf7272e2"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Максимальный объем продаж на рекламном канале: vk\n"]}]},{"cell_type":"markdown","source":["# Задание 5 (необязательно)\n","Дан список произвольной длины. Необходимо написать код, который на основе исходного списка составит словарь такого уровня вложенности, какова длина исхондого списка.\n","```\n","my_list = ['a', 'b', 'c', 'd', 'e', 'f']\n","Результат: {'a': {'b': {'c': {'d': {'e': 'f'}}}}}\n","```\n","\n"],"metadata":{"id":"hqpR7AU70sDH"}},{"cell_type":"code","source":["my_list = ['2018-01-01', 'yandex', 'cpc', 100]\n","res = my_list[-1]\n","for el in reversed(my_list[:-1]):\n","  res = {el: res}\n","print(res)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"OvaI9Rgw00wM","executionInfo":{"status":"ok","timestamp":1728504147300,"user_tz":-180,"elapsed":295,"user":{"displayName":"Григорий","userId":"15787102738944645865"}},"outputId":"ac308715-accf-4cbd-cedc-acf782632c6c"},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["{'2018-01-01': {'yandex': {'cpc': 100}}}\n"]}]}]}